{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "hidden_x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "hidden_x"}, "inbound_nodes": []}, {"name": "ip_seq", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 6, 5], "dtype": "float32", "sparse": false, "name": "ip_seq"}, "inbound_nodes": []}, {"name": "dec_sent", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "dec_sent"}, "inbound_nodes": []}, {"name": "gru_seq", "class_name": "GRU", "config": {"name": "gru_seq", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 5, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["ip_seq", 0, 0, {}], ["hidden_x", 0, 0, {}]]]}, {"name": "cat", "class_name": "Concatenate", "config": {"name": "cat", "trainable": true, "axis": -1}, "inbound_nodes": [[["hidden_x", 0, 0, {}], ["dec_sent", 0, 0, {}], ["gru_seq", 0, 0, {}]]]}, {"name": "op_sent", "class_name": "Dense", "config": {"name": "op_sent", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cat", 0, 0, {}]]]}], "input_layers": [["hidden_x", 0, 0], ["dec_sent", 0, 0], ["ip_seq", 0, 0]], "output_layers": [["op_sent", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}