{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "ip_x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "ip_x"}, "inbound_nodes": []}, {"name": "hidden_x1", "class_name": "Dense", "config": {"name": "hidden_x1", "trainable": true, "units": 20, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ip_x", 0, 0, {}]]]}, {"name": "hidden_x2", "class_name": "Dense", "config": {"name": "hidden_x2", "trainable": true, "units": 20, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_x1", 0, 0, {}]]]}, {"name": "hidden_x3", "class_name": "Dense", "config": {"name": "hidden_x3", "trainable": true, "units": 5, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_x2", 0, 0, {}]]]}, {"name": "op_x", "class_name": "Dense", "config": {"name": "op_x", "trainable": true, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_x3", 0, 0, {}]]]}], "input_layers": [["ip_x", 0, 0]], "output_layers": [["op_x", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}